app/controllers/rental_controller.rb

  def new
    @crr = CatRentalRequest.new
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def create
    @crr = CatRentalRequest.new(cat_rental_request_params)
    @cats = Cat.all
    if @crr.save
---
SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 1], ["start_date", "2019-06-02"], ["end_date", "2019-06-04"]]

  def approve
    @crr = CatRentalRequest.find(params[:rental_id])
    @cat = Cat.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def deny
    @crr = CatRentalRequest.find(params[:rental_id])
    @cat = Cat.find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]