app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "APPROVED"], ["id", 1]]
UPDATE "cat_rental_requests" SET "status" = 'DENIED' WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (end_date < '2019-06-02' or start_date > '2019-06-05') AND "cat_rental_requests"."status" = $3 AND "cat_rental_requests"."id" != $4  [["id", 1], ["cat_id", 1], ["status", "PENDING"], ["id", 1]]
---
  def approve!
    self.update(status: "APPROVED")
    overlapping_pending_requests.where.not(id: self.id).update_all(status: "DENIED")

UPDATE "cat_rental_requests" SET "status" = $1 WHERE "cat_rental_requests"."id" = $2  [["status", "DENIED"], ["id", 2]]
---
  def deny!
    self.update(status: "DENIED")