app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND "cat_rental_requests"."id" IS NOT NULL AND (cat_rental_requests.start_date > end_date AND cat_rental_requests.end_date < start_date) AND "cat_rental_requests"."status" = $2 LIMIT $3  [["cat_id", 1], ["status", "APPROVED"], ["LIMIT", 1]]
---
  def overlapping_pending_requests
    overlapping_requests.where("status == 'PENDING'"}
  end

  def does_not_overlap_approved_request
    errors[:base] << "Overlaps an already approved request" unless overlapping_approved_requests.empty?
  end
end
